---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
source: html/ca673f52-72c0-20fa-fda7-ed4e2ff2aef1.htm
---
# StructuralSectionHotRolled Properties

Common set of parameters for structural analysis.